[
  {
    "title": "Lightning Components: Simplified Reactivity, Style Lightning Web Components with Custom Aura Design Tokens, Source Tracking for Lightning Web Components in Scratch Orgs",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_lc.htm",
    "content": "All fields in a Lightning web component are now reactive. Use a custom Aura design token in Lightning web components. Track changes for Lightning web components in a scratch org when you use Salesforce command-line interface (CLI). We improved controls for Content Security Policy (CSP) and we have several critical updates."
  },
  {
    "title": "Einstein Platform Services: Image Recognition and Natural Language Processing",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_einstein_platform_services.htm",
    "content": "Not a data scientist or machine-learning expert, but still want to integrate AI into your apps? Use the Einstein Platform Services APIs to AI-enable your apps with image recognition and natural language processing. Using the Einstein Vision APIs, you can leverage pre-trained classifiers or train custom classifiers to solve an array of image recognition use cases. With the Einstein Language APIs, you can harness the power of natural language processing to analyze text and infer the sentiment or intent behind the text. Make your apps smarter and look like a genius at the same time."
  },
  {
    "title": "Einstein Platform: Prediction Insight Details",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_einstein_platform.htm",
    "content": "Are you interested in expanding the way you use Einstein AI features, like Prediction Builder, in your org? Einstein Platform is the Salesforce layer that Prediction Builder and many other Einstein features use to run powerful AI jobs. Use new Einstein Platform APIs to access prediction insights and apply the power of Einstein features in your own AI solutions."
  },
  {
    "title": "Visualforce: Introducing Lightning Message Service (Beta), Type Checking for Remote Methods with ID Parameters",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_vf.htm",
    "content": "Communicate across Visualforce, Aura, and Lightning Web Components with Lightning Message Service. Visualforce now checks that strings are properly formatted as valid Apex IDs in its JavaScript remoting tool."
  },
  {
    "title": "Apex",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_apex.htm",
    "content": "Apex security features"
  },
  {
    "title": "API",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_api.htm",
    "content": "In API version 48.0, find related object documentation more easily, get a symbol table without non-global implementation details in managed packages, and use more API calls."
  },
  {
    "title": "Custom Metadata Types",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/custom_metadata_types.htm",
    "content": "To better secure your data, we added new settings and enabled restrictions that allow you to protect potentially sensitive information."
  },
  {
    "title": "Salesforce CLI: Autocompletion, Enhanced DX Templates, Progress Bar, Code Coverage",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_sf_cli.htm",
    "content": "The Salesforce command-line interface (CLI) continues to evolve with more features and commands that support the Salesforce development models. Use it to create environments for development and testing, synchronize source code, run tests, and control the full application life cycle."
  },
  {
    "title": "Scratch Orgs: New Features",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_scratch_orgs.htm",
    "content": "A scratch org is a dedicated and configurable Salesforce environment that you can quickly spin up for many different purposes. It can be your own personal development environment, or you can create a headless scratch org for automated tests. You can create scratch orgs if you turned on Dev Hub in your production org or a Developer Edition org, or have a Dev Hub trial org. We continually add support for new features."
  },
  {
    "title": "Sandboxes: Enhanced Sandbox Cloning and Data Security",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_sandboxes.htm",
    "content": "More cloning options and increased data security are now available for sandboxes."
  },
  {
    "title": "AppExchange Partners: AppExchange App Analytics for Lightning Apps and Pages",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_forcecom_isvforce.htm",
    "content": "Learn how subscribers use your Lightning apps and pages by exploring AppExchange App Analytics data."
  },
  {
    "title": "Packaging: Faster Package Creation, New Skip Validation Option, and Changes to Flows and External Sharing Settings",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_sfdx_packaging.htm",
    "content": "Now it takes less time to create or install package versions. You can skip validation when creating new package versions. And we made changes to flows in unlocked packages, and changes to the default external sharing settings that may affect your packages."
  },
  {
    "title": "Change Data Capture: More Object Support and Event Enrichment (Pilot)",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_messaging_change_data_capture_section.htm",
    "content": "Receive change notifications for more objects, and enrich your event messages with fields (pilot)."
  },
  {
    "title": "Platform Events: Encryption Support",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_messaging_platform_events_section.htm",
    "content": "Enable the encryption of platform event messages in the event bus. Also, use a new REST API limit for accurate CometD event delivery usage."
  },
  {
    "title": "New and Changed Items for Developers",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_forcecom_development_nc.htm",
    "content": "Here is where you can find new and changed objects, calls, classes, components, commands, and more that help you customize Salesforce features."
  },
  {
    "title": "Deploy Customizations Sooner After Uploading a Change Set",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_deployment_availability_performance_.htm",
    "content": "It used to take a while before freshly uploaded change sets were available for deployment. Now, uploaded change sets are available for deployment sooner."
  },
  {
    "title": "New and Changed Components for Change Sets",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_deployment_change_sets.htm",
    "content": "The components available for a change set vary by edition. These components are now available for change sets."
  },
  {
    "title": "Authentication and Identity: Apple Sign-In, Identity Verification, and API Access Control",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_security_auth_and_identity.htm",
    "content": "Enable Apple sign-in for your orgs and communities, allowing users to authenticate with their Apple ID, Face ID, or Touch ID. Enhance identity verification security by storing domain verification files for external services and enabling verification methods that are more secure than email. Restrict external user access to Salesforce APIs through connected apps that are installed in your org or community. And apply the Request Signature Methods to single logout, have extra time to approve OAuth authentication requests, and troubleshoot bridged OAuth sessions."
  },
  {
    "title": "Domains: Custom Domains for Sandboxes (Pilot), Salesforce Edge, Instanceless URLs, and Certificate Changes for My Domains",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_security_domains.htm",
    "content": ""
  },
  {
    "title": "Salesforce Shield: Real-Time Event Monitoring Threat Detection (Beta), Event Monitoring Analytics App Improvements, and Platform Encryption for Platform Events",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_security_shield.htm",
    "content": ""
  },
  {
    "title": "Data Protection and Privacy: Party Consent, Communication Subscription, and Contact Point Objects",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_security_data_protection_privacy.htm",
    "content": "Store data related to your customers' general consent preferences and the communications that they subscribe to. You can also associate multiple email addresses or phone numbers to individuals or person accounts, and manage their preferred time and consent to be contacted."
  },
  {
    "title": "Other Security Changes: Guest User Record Assignment, External URL Whitelist, and Setup Enhancements",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_security_other_changes.htm#rn_security_other_changes",
    "content": "Set up a default owner for any records created by guest users in Salesforce Sites. Whitelist external URLs that users are allowed to navigate to directly. Plus, we made improvements to Session Security Level Policies and the Setup Audit Trail."
  },
  {
    "title": "Lightning Flow: Before-Save Updates, Generic Apex Actions, System Context, Opportunity Contact Roles, and Simplified Configuration",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_forcecom_flow.htm",
    "content": "Create record-triggered flows that make fast field updates. Developers can create Apex actions for any object. Run flows with system privileges, enforcing only the running user’s record-level access. Automate processes with opportunity contact roles. Build flows more efficiently and easily. These changes apply to both Lightning Experience and Salesforce Classic."
  },
  {
    "title": "Globalization: Translation Workbench Improvements, Right-to-Left Language Support, and New and Updated Locale Formats",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_forcecom_globalization.htm",
    "content": "Keep your translations up to date by exporting outdated translations along with untranslated values. Arabic, Hebrew, and Urdu flow right to left. Enable new and improved formats for international dates and times via a critical update, and prepare for changes to International Components for Unicode (ICU) and Oracle’s Java Development Kit (JDK) locale formats in this release."
  },
  {
    "title": "Einstein Prediction Builder: Try Einstein Prediction Builder, Make Informed Predictions with Trusted AI Help, and Build Filter-Based Predictions",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_forcecom_einstein.htm",
    "content": "Build up to 10 predictions and enable 1 of them at no additional cost. As you build predictions, refer to the Trusted AI sidebar tab for help with identifying sources of bias. When your prediction question doesn’t conveniently map to a field, build a filter-based prediction instead. Add the Einstein Predictions component to your page layouts to display top predictors on individual records."
  },
  {
    "title": "Einstein Next Best Action: Analyze Recommendation Strategy Metrics, Create Recommendations from the Records of Any Salesforce Object, and Launch a Flow when Recommendations are Rejected",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_forcecom_nba.htm",
    "content": "Analyze metrics at both the strategy and the recommendation level. Discover how many served recommendations in an org were accepted and rejected. Declaratively create recommendations from the records of any Salesforce object. Serve recommendations from accounts, contacts, opportunities, and products. Launch a flow when a user rejects a recommendation and display a questionnaire or run an automated process."
  },
  {
    "title": "Lightning App Builder: Mobile Enhancements for All, Guidance for App Builder, and Increased Component Capacity in Page Regions",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_forcecom_lab.htm",
    "content": "Design better and more efficient Lightning pages for desktop and mobile with mobile-related enhancements to the Lightning App Builder UI, and with tips delivered via in-app guidance. Include up to 100 components in a single page region."
  },
  {
    "title": "External Data: Private Connect Pilot, Changed Encryption for External Credentials",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_forcecom_external_data.htm",
    "content": "Use Private Connect to integrate third-party services with Salesforce without exposure to the public internet. Your external data credentials are now encrypted with an updated framework for added security."
  },
  {
    "title": "Permission Set Groups: Greater Flexibility in Granting Permissions (Generally Available)",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_forcecom_permission_set_groups.htm",
    "content": "Permission set groups are an ideal way to consistently and reliably assign permissions to a group of users. Assign users a single permission set group instead of multiple permission sets. Permission set groups combine selected permission sets to provide all the permissions that users need for their job function. Remove individual permissions from a group with the muting permission set feature to ensure that permissions do not exceed user job functions.This change applies to Lightning Experience and Salesforce Classic."
  },
  {
    "title": "Sharing: Enhancements to External Organization-Wide Defaults",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_forcecom_sharing.htm",
    "content": "To better secure your data, the External Sharing Model is enabled by default in all Salesforce orgs created in Spring ’20 or later and can no longer be disabled. Plus, you can now set external access levels for the Lead and Campaign objects."
  },
  {
    "title": "AppExchange: Support for Trailblazer.me and Enhanced Salesforce Consultant Reviews",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_forcecom_appexchange.htm",
    "content": "Use your Trailblazer.me account to manage your installs, subscriptions, and settings on AppExchange. Learn more about a Salesforce consultant’s past performance with verified project reviews and enhanced community feedback."
  },
  {
    "title": "General Setup: Custom Settings Enhancements and Improved Connections with Enhanced External Services",
    "href": "https://releasenotes.docs.salesforce.com/en-us/spring20/release-notes/rn_forcecom_custom_general.htm",
    "content": "Protect and control who has access to custom settings. Create better connections to outside services with Enhanced External Services."
  }
]
